{"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"strides": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "filters": 64, "batch_input_shape": [null, 28, 28, 1], "padding": "valid", "bias_constraint": null, "trainable": true, "kernel_size": [3, 3], "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "dilation_rate": [1, 1], "name": "conv2d_1", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last", "trainable": true, "padding": "valid", "name": "max_pooling2d_1"}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "filters": 64, "padding": "valid", "bias_constraint": null, "kernel_size": [3, 3], "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "dilation_rate": [1, 1], "name": "conv2d_2", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last", "trainable": true, "padding": "valid", "name": "max_pooling2d_2"}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "filters": 64, "padding": "valid", "bias_constraint": null, "kernel_size": [3, 3], "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "dilation_rate": [1, 1], "name": "conv2d_3", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last", "trainable": true, "padding": "valid", "name": "max_pooling2d_3"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "kernel_regularizer": null, "activation": "relu", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "units": 128, "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "name": "dense_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "rate": 0.2}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "kernel_regularizer": null, "activation": "softmax", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "units": 25, "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "name": "dense_2"}}], "keras_version": "2.0.6", "backend": "theano"}