{"backend": "theano", "class_name": "Sequential", "keras_version": "2.0.6", "config": [{"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "dtype": "float32", "strides": [1, 1], "dilation_rate": [1, 1], "bias_regularizer": null, "batch_input_shape": [null, 28, 28, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_constraint": null, "bias_constraint": null, "activation": "linear", "activity_regularizer": null, "padding": "same", "use_bias": true, "data_format": "channels_last", "kernel_size": [8, 8], "name": "conv2d_1", "kernel_regularizer": null, "filters": 32}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "strides": [1, 1], "bias_constraint": null, "bias_regularizer": null, "name": "conv2d_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_constraint": null, "activation": "relu", "activity_regularizer": null, "padding": "valid", "use_bias": true, "data_format": "channels_last", "kernel_size": [5, 5], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "strides": [2, 2], "padding": "valid", "name": "max_pooling2d_1", "pool_size": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "strides": [1, 1], "bias_constraint": null, "bias_regularizer": null, "name": "conv2d_3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_constraint": null, "activation": "relu", "activity_regularizer": null, "padding": "valid", "use_bias": true, "data_format": "channels_last", "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "strides": [2, 2], "padding": "valid", "name": "max_pooling2d_2", "pool_size": [2, 2], "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"rate": 0.25, "trainable": true, "name": "dropout_1"}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "strides": [1, 1], "bias_constraint": null, "bias_regularizer": null, "name": "conv2d_4", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_constraint": null, "activation": "relu", "activity_regularizer": null, "padding": "same", "use_bias": true, "data_format": "channels_last", "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "strides": [1, 1], "bias_constraint": null, "bias_regularizer": null, "name": "conv2d_5", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_constraint": null, "activation": "relu", "activity_regularizer": null, "padding": "valid", "use_bias": true, "data_format": "channels_last", "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "strides": [2, 2], "padding": "valid", "name": "max_pooling2d_3", "pool_size": [2, 2], "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "name": "dropout_2"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activation": "linear", "activity_regularizer": null, "units": 128, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "name": "dense_1", "kernel_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activation": "linear", "activity_regularizer": null, "units": 25, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "name": "dense_2", "kernel_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "sigmoid"}}]}