{"keras_version": "2.0.6", "config": [{"config": {"filters": 128, "dtype": "float32", "activity_regularizer": null, "kernel_regularizer": null, "kernel_size": [3, 3], "padding": "same", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "name": "conv2d_1", "strides": [1, 1], "bias_constraint": null, "batch_input_shape": [null, 28, 28, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "use_bias": true, "activation": "linear", "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"filters": 128, "padding": "valid", "activity_regularizer": null, "kernel_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "name": "conv2d_2", "strides": [1, 1], "bias_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "dilation_rate": [1, 1], "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "pool_size": [2, 2], "trainable": true, "strides": [2, 2], "name": "max_pooling2d_1", "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"filters": 256, "padding": "valid", "activity_regularizer": null, "kernel_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "name": "conv2d_3", "strides": [1, 1], "bias_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "dilation_rate": [1, 1], "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "pool_size": [2, 2], "trainable": true, "strides": [2, 2], "name": "max_pooling2d_2", "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "trainable": true, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"filters": 256, "padding": "same", "activity_regularizer": null, "kernel_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "name": "conv2d_4", "strides": [1, 1], "bias_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "dilation_rate": [1, 1], "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"filters": 128, "padding": "valid", "activity_regularizer": null, "kernel_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "name": "conv2d_5", "strides": [1, 1], "bias_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "dilation_rate": [1, 1], "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "pool_size": [2, 2], "trainable": true, "strides": [2, 2], "name": "max_pooling2d_3", "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_2", "trainable": true, "rate": 0.2}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "dense_1", "bias_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "trainable": true, "units": 128, "activation": "linear"}, "class_name": "Dense"}, {"config": {"name": "activation_2", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "dense_2", "bias_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "trainable": true, "units": 25, "activation": "linear"}, "class_name": "Dense"}, {"config": {"name": "activation_3", "trainable": true, "activation": "softmax"}, "class_name": "Activation"}], "class_name": "Sequential", "backend": "theano"}