{"backend": "tensorflow", "config": [{"config": {"use_bias": true, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "padding": "same", "name": "conv2d_1", "filters": 128, "data_format": "channels_last", "dilation_rate": [1, 1], "batch_input_shape": [null, 28, 28, 1], "trainable": true, "dtype": "float32", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "kernel_regularizer": null, "activation": "linear", "kernel_constraint": null, "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_1"}, "class_name": "Activation"}, {"config": {"use_bias": true, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "padding": "valid", "name": "conv2d_2", "filters": 128, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [3, 3], "trainable": true, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "kernel_regularizer": null, "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2], "trainable": true, "padding": "valid", "name": "max_pooling2d_1"}, "class_name": "MaxPooling2D"}, {"config": {"use_bias": true, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "padding": "valid", "name": "conv2d_3", "filters": 256, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [3, 3], "trainable": true, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "kernel_regularizer": null, "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2], "trainable": true, "padding": "valid", "name": "max_pooling2d_2"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "dropout_1", "rate": 0.5}, "class_name": "Dropout"}, {"config": {"use_bias": true, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "padding": "same", "name": "conv2d_4", "filters": 256, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [3, 3], "trainable": true, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "kernel_regularizer": null, "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"use_bias": true, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "padding": "valid", "name": "conv2d_5", "filters": 128, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [3, 3], "trainable": true, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "kernel_regularizer": null, "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2], "trainable": true, "padding": "valid", "name": "max_pooling2d_3"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "dropout_2", "rate": 0.2}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"use_bias": true, "bias_constraint": null, "activity_regularizer": null, "units": 625, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "trainable": true, "name": "dense_1", "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_2"}, "class_name": "Activation"}, {"config": {"use_bias": true, "bias_constraint": null, "activity_regularizer": null, "units": 25, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "trainable": true, "name": "dense_2", "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"activation": "softmax", "trainable": true, "name": "activation_3"}, "class_name": "Activation"}], "keras_version": "2.0.6", "class_name": "Sequential"}